---
kind: property
id: P:Autodesk.Revit.DB.SpecTypeId.Int.NumberOfPoles
source: html/6c448371-c0e7-314e-089f-bd21fdd519e1.htm
---
# Autodesk.Revit.DB.SpecTypeId.Int.NumberOfPoles Property

Number of Poles, in discipline Electrical.

## Syntax (C#)
```csharp
public static ForgeTypeId NumberOfPoles { get; }
```